balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1789.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL5" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL5" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL5" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL5" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL6" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL6" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL6" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL6" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL7" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL7" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL7" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL7" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL8" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL8" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL8" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL8" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL9" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL9" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL9" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL9" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL10" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL10" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL10" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL10" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL11" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL11" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL11" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL11" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL12" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL12" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL12" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL12" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL13" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL13" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL13" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL13" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL14" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL14" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL14" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL14" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL15" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL15" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL15" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL15" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL16" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL16" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL16" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL16" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
