balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1789.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL17" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL17" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL17" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL17" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL18" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL18" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL18" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL18" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL19" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL19" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL19" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL19" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL20" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL20" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL20" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL20" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL21" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL21" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL21" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL21" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL22" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL22" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL22" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL22" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL23" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL23" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL23" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL23" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL24" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL24" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL24" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL24" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL25" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL25" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL25" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL25" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL26" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL26" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL26" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL26" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL27" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL27" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL27" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL27" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL28" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL28" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL28" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL28" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL29" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL29" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL29" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL29" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL30" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL30" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL30" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL30" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL31" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL31" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL31" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL31" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
